In [1]:
import pandas as pd

filepath = '/Users/cindy/Developer/SQL/sql-job-analysis/sql_result/6_skills.csv'
df = pd.read_csv(filepath)
df.head()

,skill,demand_count,avg_salary,min_salary,max_salary,median_salary,index_dcount,percentile_by_demand_count,index_asalary,percentile_by_avg_salary
0,sql,3083,96435,30000,375000,92500.0,1,1,69,67
1,excel,2143,86419,30000,375000,84500.0,2,1,87,85
2,python,1840,101512,35000,375000,98500.0,3,2,48,46
3,tableau,1659,97978,30000,375000,95000.0,4,2,64,62
4,r,1073,98708,35000,375000,92527.5,5,3,62,60